Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation enum defines the possible relation types of numeric input values.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.Offset
The value is an offset from a reference point in the cursor direction.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.Relative
The value is relative to a reference value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.Absolute
The value is an absolute value. Prefixed by XS_KEYIN_ABSOLUTE_PREFIX, the default is '$'.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.Spacing
The value defines spacing data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.Global
The value is relative to the global origin. Prefixed by XS_KEYIN_GLOBAL_PREFIX, the default is '!'.